Repository: giellalt/corpus-nob
Catalog: tmx/sme/admin/sd/samediggi.no/apply_as_an_internship_at_walt_disney_animation_studios_2022.html.tmx
Source language: nob
Languages: sme

source: Apply as an internship at Walt Disney Animation Studios 2022
sme: Oza oahpahallin Walt Disney Animation Studioi 2022

source: Are you a current or recent student studying art, animation, computer graphics, and film?
sme: Leat go gazzame oahpu dahje aitto gárven oahpu dáidda-, animašuvdna-, gráfalaš- dahje filbmasuorggis?

source: Walt Disney Animation Studios are inviting students from Sápmi to apply as an internship for the Summer Internship Program in May 2022.
sme: Walt Disney Animation Studios bovdejit sámi oahpahalli ohcat sin oahpahalliprográmmii, mii álgá miessemánus 2022.

source: As a Talent Development intern, you will have the unique opportunity to work directly with a Disney mentor as you explore all aspects of art, storytelling, and filmmaking.
sme: Taleanttaid ovdánahttinoahpahallin oaččut erenomáš vejolašvuođa bargat ovttas Disney-bagadeddjiin ja guorahallat buot beliid dáidda-, muitalushábmen- ja filbmasuorggis.

source: Walt Disney Animation Studios Summer Internship Program is a 10-week program, paid experience designed for students studying art, animation, computer graphics, and film.
sme: Walt Disney Animation Studios Summer Internship Program bistá 10 vahku, ja dat lea máksojuvvon prográmma, mii lea heivehuvvon sidjiide, geat lohket dáidaga, animašuvnna, dihtorgrafihka ja filbmasuorggi.

source: Please note, the safety and well-being of our teams is very important to us. We will be determining whether this program will be in-person at our Burbank, CA studio or virtual in the coming months based on government recommendations.
sme: Fuomáš: sihkkarvuohta ja dearvvašvuohta leat hui dehálaččat midjiide.

source: Read more about their internship program and requirements here:
sme: Eiseválddiid rávvagiid mielde mearriduvvo čađahuvvo go prográmma gáiddusin vuoi Burbank CA studios.

source: Story Intern Visual Development Intern Animation Intern Set Extension Intern Production Management Intern Animation Research Library Intern
sme: Loga eambbo sin oahpahalliprográmma ja eavttuid birra dás:

source: The deadline for applications is 16.01. 2022, 11:59 PM Pacific Standard Time (Notice the time difference).
sme: Story Intern Visual Development Intern Animation Intern Set Extension Intern Production Management Intern Animation Research Library Intern

source: Travel grant
sme: Ohcanáigemearri WDAS oahpahallin: 16.01. 2022, 11:59 PM Pacific Standard Time (Fuomáš áigeerohusa).

source: The internship form Sámi areas can apply for a 10.000$ travel grant, funded by The Saami Council and the Sámi parliaments.
sme: Mátkestipeanda

source: The applicant must have Sámi background, meets Disney's requirements for internships and should have a plan for how to bring the knowledge back to the Sami community, such as through social media, lectures etc.Write an application, max 1 page, explaining your applicant basis and how to meet our travel grant requirements.
sme: Oahpahalli galgá ohcat 10.000 $ sturrosaš mátkestipeandda, man Sámiráđđi ja Sámedikkit almmuhit dán oktavuođas.

source: Send your application for travel grant marked with "WDAS internship” to: kmr@saamicouncil.net .
sme: Ohccis galgá leat sámi duogáš, son galgá deavdit WDAS eavttuid oahpahallái ja sus galgá leat plána das mo son áigu máhcahit gelbbolašvuođa ruovttoluotta sámi servodahkii, nu go omd. sosiála mediaid bokte, logaldallamiid bokte jnv. Čális eanemustá 1 siiddu guhkkosaš ohcamuša, mas čilget man vuođul ozat oahpahallin ja mo áiggut čoavdit mátkestipeandda eavttuid.

source: The deadline for travel applications is 16.01.2022, 11:59 PM Pacific Standard Time (Notice the time difference).
sme: Sádde ohcamuša dán čujuhussii ja merke ohcamuša “WDAS oahpahalli”: kmr@saamicouncil.net .

source: Contact info
sme: Mátkestipeandda ohcanáigemearri: 16.01.2022, 11:59 PM Pacific Standard Time (Fuomaš áigeerohusa).

source: Christina Hætta, Sámiráđđi +47 48021734 christina@saamicouncil.net
sme: Oktavuođadieđut
